In [57]:
import pandas as pd
import copy

In [55]:
traffic_origin=pd.read_csv("C:/Users/19178/Desktop\suwoon/도로별 통행량/TMAP_DATA.csv",header=None)

In [71]:
traffic=copy.copy(traffic_origin)

In [59]:
traffic.shape

(3146567, 6)

In [60]:
traffic.columns

Int64Index([0, 1, 2, 3, 4, 5], dtype='int64')

In [17]:
traffic.head()

              0           1    2      3      4  5
0  201910310000  1000000301  151  27.39  19.84  5
1  201910310000  1000000302  105  27.39  13.80  5
2  201910310000  1000000303   67  27.39   8.80  5
3  201910310000  1000000401  151  17.52  31.02  9
4  201910310000  1000000402  105  17.52  21.57  9

In [19]:
note=pd.read_excel("C:/Users/19178/Desktop/suwoon/도로별 통행량/TR081900010001_v2.0.xlsx")

In [21]:
note.tail(10)

,데이터셋,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6
7,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,테이블,NaN,NaN,NaN,NaN,NaN,NaN
9,테이블명(한글),5분 단위 회전별 교통정보,NaN,NaN,테이블명(영문),TB_COL_SK_TURN_INFO_KS,NaN
10,컬럼명(한글),컬럼명(영문),컬럼 설명,데이터 타입,코드값 여부,코드 테이블,비고
11,정보기준시각,base_dttm,yyyymmddhhmmss,TEXT,N,NaN,NaN
12,진입 표준링크 ID,ks_link_id,국가표준노드링크 기준 진입 링크ID,TEXT,N,NaN,NaN
13,진출 표준링크 ID,next_ks_link_id,국가표준노드링크 기준 진출(직진/좌/우회전) 링크ID,TEXT,N,NaN,NaN
14,평균통행시간 (sec),travel_time,수집된 개별 통행정보의 평균 진입링크 통행 시간,INTEGER,N,NaN,NaN
15,평균통행속도 (km/h),travel_speed,진입링크의 길이를 평균통행속도로 나눈 값,INTEGER,N,NaN,NaN
16,수량,travel_vol,수집 교통량,INTEGER,N,NaN,NaN

In [24]:
col_info=note[10:]

In [32]:
col_info.iloc[:,1].values[1:]

array(['base_dttm', 'ks_link_id', 'next_ks_link_id', 'travel_time',
       'travel_speed', 'travel_vol'], dtype=object)

In [73]:
traffic.columns=col_info.iloc[:,1].values[1:]

In [62]:
traffic.head(5)

,base_dttm,ks_link_id,next_ks_link_id,travel_time,travel_speed,travel_vol
0,201910310000,1000000301,151,27.39,19.84,5
1,201910310000,1000000302,105,27.39,13.80,5
2,201910310000,1000000303,67,27.39,8.80,5
3,201910310000,1000000401,151,17.52,31.02,9
4,201910310000,1000000402,105,17.52,21.57,9

In [37]:
len(traffic.ks_link_id.unique())

13742

In [38]:
len(traffic.next_ks_link_id.unique())

1106

In [41]:
traffic.dtypes # 날짜 데이터 str로

base_dttm            int64
ks_link_id           int64
next_ks_link_id      int64
travel_time        float64
travel_speed       float64
travel_vol           int64
dtype: object

In [74]:
traffic.base_dttm=traffic.base_dttm.astype('str')

In [64]:
traffic.base_dttm.head(5)

0    201910310000
1    201910310000
2    201910310000
3    201910310000
4    201910310000
Name: base_dttm, dtype: object

In [75]:
traffic.base_dttm=pd.to_datetime(traffic.base_dttm,format='%Y%m%d%H%M')

In [76]:
traffic.dtypes

base_dttm          datetime64[ns]
ks_link_id                  int64
next_ks_link_id             int64
travel_time               float64
travel_speed              float64
travel_vol                  int64
dtype: object

In [80]:
traffic.base_dttm.dt.year

0          2019
1          2019
2          2019
3          2019
4          2019
           ...
3146562    2019
3146563    2019
3146564    2019
3146565    2019
3146566    2019
Name: base_dttm, Length: 3146567, dtype: int64

In [53]:
traffic.groupby(['ks_link_id','next_ks_link_id']).count()

                            base_dttm  travel_time  travel_speed  travel_vol
ks_link_id next_ks_link_id
1000000301 151                    278          278           278         278
1000000302 105                    278          278           278         278
1000000303 67                     278          278           278         278
1000000401 151                    285          285           285         285
1000000402 105                    285          285           285         285
...                               ...          ...           ...         ...
1240217400 501                    267          267           267         267
1240217500 385                    259          259           259         259
1240217600 575                    256          256           256         256
1240217700 247                    259          259           259         259
1240217800 362                    240          240           240         240

[13742 rows x 4 columns]

In [81]:
traffic.tail(10)

,base_dttm,ks_link_id,next_ks_link_id,travel_time,travel_speed,travel_vol
3146557,2019-10-31 23:55:00,1240216900,202,54.88,13.25,9
3146558,2019-10-31 23:55:00,1240217000,159,52.22,10.96,3
3146559,2019-10-31 23:55:00,1240217100,693,44.00,56.70,1
3146560,2019-10-31 23:55:00,1240217200,429,55.00,28.08,1
3146561,2019-10-31 23:55:00,1240217300,536,44.00,43.85,1
3146562,2019-10-31 23:55:00,1240217400,501,44.00,40.99,3
3146563,2019-10-31 23:55:00,1240217500,385,44.00,31.50,8
3146564,2019-10-31 23:55:00,1240217600,575,55.00,37.64,5
3146565,2019-10-31 23:55:00,1240217700,247,43.30,20.53,3
3146566,2019-10-31 23:55:00,1240217800,362,44.00,29.62,3